zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_ADC.h
#define ADC_CLIST1_SAMPLE2_MASK                  (0xF00U)
#define ADC_CLIST1_SAMPLE2_SHIFT                 (8U)
/*! SAMPLE2 - Sample Field 2
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST1_SAMPLE2(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST1_SAMPLE2_SHIFT)) & ADC_CLIST1_SAMPLE2_MASK)

#define ADC_CLIST1_SAMPLE3_MASK                  (0xF000U)
#define ADC_CLIST1_SAMPLE3_SHIFT                 (12U)
/*! SAMPLE3 - Sample Field 3
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST1_SAMPLE3(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST1_SAMPLE3_SHIFT)) & ADC_CLIST1_SAMPLE3_MASK)
/*! @} */

/*! @name CLIST2 - ADC Channel List Register 2 */
/*! @{ */

#define ADC_CLIST2_SAMPLE4_MASK                  (0xFU)
#define ADC_CLIST2_SAMPLE4_SHIFT                 (0U)
/*! SAMPLE4 - Sample Field 4
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST2_SAMPLE4(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE4_SHIFT)) & ADC_CLIST2_SAMPLE4_MASK)

#define ADC_CLIST2_SAMPLE5_MASK                  (0xF0U)
#define ADC_CLIST2_SAMPLE5_SHIFT                 (4U)
/*! SAMPLE5 - Sample Field 5
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST2_SAMPLE5(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE5_SHIFT)) & ADC_CLIST2_SAMPLE5_MASK)

#define ADC_CLIST2_SAMPLE6_MASK                  (0xF00U)
#define ADC_CLIST2_SAMPLE6_SHIFT                 (8U)
/*! SAMPLE6 - Sample Field 6
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST2_SAMPLE6(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE6_SHIFT)) & ADC_CLIST2_SAMPLE6_MASK)

#define ADC_CLIST2_SAMPLE7_MASK                  (0xF000U)
#define ADC_CLIST2_SAMPLE7_SHIFT                 (12U)
/*! SAMPLE7 - Sample Field 7
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST2_SAMPLE7(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST2_SAMPLE7_SHIFT)) & ADC_CLIST2_SAMPLE7_MASK)
/*! @} */

/*! @name CLIST3 - ADC Channel List Register 3 */
/*! @{ */

#define ADC_CLIST3_SAMPLE8_MASK                  (0xFU)
#define ADC_CLIST3_SAMPLE8_SHIFT                 (0U)
/*! SAMPLE8 - Sample Field 8
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST3_SAMPLE8(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE8_SHIFT)) & ADC_CLIST3_SAMPLE8_MASK)

