zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_ADC.h
#define ADC_CLIST3_SAMPLE9_MASK                  (0xF0U)
#define ADC_CLIST3_SAMPLE9_SHIFT                 (4U)
/*! SAMPLE9 - Sample Field 9
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST3_SAMPLE9(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE9_SHIFT)) & ADC_CLIST3_SAMPLE9_MASK)

#define ADC_CLIST3_SAMPLE10_MASK                 (0xF00U)
#define ADC_CLIST3_SAMPLE10_SHIFT                (8U)
/*! SAMPLE10 - Sample Field 10
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST3_SAMPLE10(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE10_SHIFT)) & ADC_CLIST3_SAMPLE10_MASK)

#define ADC_CLIST3_SAMPLE11_MASK                 (0xF000U)
#define ADC_CLIST3_SAMPLE11_SHIFT                (12U)
/*! SAMPLE11 - Sample Field 11
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST3_SAMPLE11(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST3_SAMPLE11_SHIFT)) & ADC_CLIST3_SAMPLE11_MASK)
/*! @} */

/*! @name CLIST4 - ADC Channel List Register 4 */
/*! @{ */

#define ADC_CLIST4_SAMPLE12_MASK                 (0xFU)
#define ADC_CLIST4_SAMPLE12_SHIFT                (0U)
/*! SAMPLE12 - Sample Field 12
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST4_SAMPLE12(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE12_SHIFT)) & ADC_CLIST4_SAMPLE12_MASK)

#define ADC_CLIST4_SAMPLE13_MASK                 (0xF0U)
#define ADC_CLIST4_SAMPLE13_SHIFT                (4U)
/*! SAMPLE13 - Sample Field 13
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST4_SAMPLE13(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE13_SHIFT)) & ADC_CLIST4_SAMPLE13_MASK)

#define ADC_CLIST4_SAMPLE14_MASK                 (0xF00U)
#define ADC_CLIST4_SAMPLE14_SHIFT                (8U)
/*! SAMPLE14 - Sample Field 14
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST4_SAMPLE14(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE14_SHIFT)) & ADC_CLIST4_SAMPLE14_MASK)

#define ADC_CLIST4_SAMPLE15_MASK                 (0xF000U)
#define ADC_CLIST4_SAMPLE15_SHIFT                (12U)
/*! SAMPLE15 - Sample Field 15
 *  0b0000..single-ended: ANA0, Differential: ANA0+, ANA1-
 *  0b0001..single-ended: ANA1, Differential: ANA0+, ANA1-
 *  0b0010..single-ended: ANA2, Differential: ANA2+, ANA3-
 *  0b0011..single-ended: ANA3, Differential: ANA2+, ANA3-
 *  0b0100..single-ended: ANA4, Differential: ANA4+, ANA5-
 *  0b0101..single-ended: ANA5, Differential: ANA4+, ANA5-
 *  0b0110..single-ended: ANA6, Differential: ANA6+, ANA7-
 *  0b0111..single-ended: ANA7, Differential: ANA6+, ANA7-
 *  0b1000..single-ended: ANB0, Differential: ANB0+, ANB1-
 *  0b1001..single-ended: ANB1, Differential: ANB0+, ANB1-
 *  0b1010..single-ended: ANB2, Differential: ANB2+, ANB3-
 *  0b1011..single-ended: ANB3, Differential: ANB2+, ANB3-
 *  0b1100..single-ended: ANB4, Differential: ANB4+, ANB5-
 *  0b1101..single-ended: ANB5, Differential: ANB4+, ANB5-
 *  0b1110..single-ended: ANB6, Differential: ANB6+, ANB7-
 *  0b1111..single-ended: ANB7, Differential: ANB6+, ANB7-
 */
#define ADC_CLIST4_SAMPLE15(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_CLIST4_SAMPLE15_SHIFT)) & ADC_CLIST4_SAMPLE15_MASK)
/*! @} */

/*! @name SDIS - ADC Sample Disable Register */
/*! @{ */

#define ADC_SDIS_DS_MASK                         (0xFFFFU)
#define ADC_SDIS_DS_SHIFT                        (0U)
/*! DS - Disable Sample Bits
 *  0b0000000000000000..Bit value 0: enables CLISTn[SAMPLEx].
 *  0b0000000000000001..Bit value 1: disables CLISTn[SAMPLEx] and all subsequent samples. Which samples are
 *                      actually disabled will depend on the conversion mode, sequential/parallel, and the value of
 *                      CTRL2[SIMULT].
 */
#define ADC_SDIS_DS(x)                           (((uint16_t)(((uint16_t)(x)) << ADC_SDIS_DS_SHIFT)) & ADC_SDIS_DS_MASK)
/*! @} */

/*! @name STAT - ADC Status Register */
/*! @{ */

