zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_ADC.h
#define ADC_LOLIMSTAT2_LLS_MASK                  (0xFU)
#define ADC_LOLIMSTAT2_LLS_SHIFT                 (0U)
/*! LLS - Low Limit Status Bits */
#define ADC_LOLIMSTAT2_LLS(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_LOLIMSTAT2_LLS_SHIFT)) & ADC_LOLIMSTAT2_LLS_MASK)
/*! @} */

/*! @name HILIMSTAT2 - ADC High Limit Status Register 2 */
/*! @{ */

#define ADC_HILIMSTAT2_HLS_MASK                  (0xFU)
#define ADC_HILIMSTAT2_HLS_SHIFT                 (0U)
/*! HLS - High Limit Status Bits */
#define ADC_HILIMSTAT2_HLS(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_HILIMSTAT2_HLS_SHIFT)) & ADC_HILIMSTAT2_HLS_MASK)
/*! @} */

/*! @name ZXSTAT2 - ADC Zero Crossing Status Register 2 */
/*! @{ */

#define ADC_ZXSTAT2_ZCS_MASK                     (0xFU)
#define ADC_ZXSTAT2_ZCS_SHIFT                    (0U)
/*! ZCS - Zero Crossing Status
 *  0b0000..Either: A sign change did not occur in a comparison between the current channel[x] result and the
 *          previous channel[x] result, or Zero crossing control is disabled for channel[x] in the zero crossing
 *          control register (ZXCTRL3)
 *  0b0001..In a comparison between the current channel[x] result and the previous channel[x] result, a sign
 *          change condition occurred as defined in the zero crossing control register (ZXCTRL3)
 */
#define ADC_ZXSTAT2_ZCS(x)                       (((uint16_t)(((uint16_t)(x)) << ADC_ZXSTAT2_ZCS_SHIFT)) & ADC_ZXSTAT2_ZCS_MASK)
/*! @} */

/*! @name RSLT2 - ADC Result Registers 2 with sign extension */
/*! @{ */

#define ADC_RSLT2_RSLT_MASK                      (0x7FF8U)
#define ADC_RSLT2_RSLT_SHIFT                     (3U)
/*! RSLT - Digital Result of the Conversion */
#define ADC_RSLT2_RSLT(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_RSLT2_RSLT_SHIFT)) & ADC_RSLT2_RSLT_MASK)

#define ADC_RSLT2_SEXT_MASK                      (0x8000U)
#define ADC_RSLT2_SEXT_SHIFT                     (15U)
/*! SEXT - Sign Extend */
#define ADC_RSLT2_SEXT(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_RSLT2_SEXT_SHIFT)) & ADC_RSLT2_SEXT_MASK)
/*! @} */

/*! @name LOLIM2 - ADC Low Limit Registers 2 */
/*! @{ */

#define ADC_LOLIM2_LLMT_MASK                     (0x7FF8U)
#define ADC_LOLIM2_LLMT_SHIFT                    (3U)
/*! LLMT - Low Limit Bits */
#define ADC_LOLIM2_LLMT(x)                       (((uint16_t)(((uint16_t)(x)) << ADC_LOLIM2_LLMT_SHIFT)) & ADC_LOLIM2_LLMT_MASK)
/*! @} */

/*! @name HILIM2 - ADC High Limit Registers 2 */
/*! @{ */

#define ADC_HILIM2_HLMT_MASK                     (0x7FF8U)
#define ADC_HILIM2_HLMT_SHIFT                    (3U)
/*! HLMT - High Limit Bits */
#define ADC_HILIM2_HLMT(x)                       (((uint16_t)(((uint16_t)(x)) << ADC_HILIM2_HLMT_SHIFT)) & ADC_HILIM2_HLMT_MASK)
/*! @} */

/*! @name OFFST2 - ADC Offset Registers 2 */
/*! @{ */

#define ADC_OFFST2_OFFSET_MASK                   (0x7FF8U)
#define ADC_OFFST2_OFFSET_SHIFT                  (3U)
/*! OFFSET - ADC Offset Bits */
#define ADC_OFFST2_OFFSET(x)                     (((uint16_t)(((uint16_t)(x)) << ADC_OFFST2_OFFSET_SHIFT)) & ADC_OFFST2_OFFSET_MASK)
/*! @} */

/*! @name GC3 - Gain Control 3 Register */
/*! @{ */

#define ADC_GC3_GAIN16_MASK                      (0x3U)
#define ADC_GC3_GAIN16_SHIFT                     (0U)
/*! GAIN16 - Gain Control Bit 16
 *  0b00..x1 amplification
 *  0b01..x2 amplification
 *  0b10..x4 amplification
 *  0b11..reserved
 */
#define ADC_GC3_GAIN16(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_GC3_GAIN16_SHIFT)) & ADC_GC3_GAIN16_MASK)

#define ADC_GC3_GAIN17_MASK                      (0xCU)
#define ADC_GC3_GAIN17_SHIFT                     (2U)
/*! GAIN17 - Gain Control Bit 17
 *  0b00..x1 amplification
 *  0b01..x2 amplification
 *  0b10..x4 amplification
 *  0b11..reserved
 */
#define ADC_GC3_GAIN17(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_GC3_GAIN17_SHIFT)) & ADC_GC3_GAIN17_MASK)

#define ADC_GC3_GAIN18_MASK                      (0x30U)
#define ADC_GC3_GAIN18_SHIFT                     (4U)
/*! GAIN18 - Gain Control Bit 18
 *  0b00..x1 amplification
 *  0b01..x2 amplification
 *  0b10..x4 amplification
 *  0b11..reserved
 */
#define ADC_GC3_GAIN18(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_GC3_GAIN18_SHIFT)) & ADC_GC3_GAIN18_MASK)

#define ADC_GC3_GAIN19_MASK                      (0xC0U)
#define ADC_GC3_GAIN19_SHIFT                     (6U)
/*! GAIN19 - Gain Control Bit 19
 *  0b00..x1 amplification
 *  0b01..x2 amplification
 *  0b10..x4 amplification
 *  0b11..reserved
 */
#define ADC_GC3_GAIN19(x)                        (((uint16_t)(((uint16_t)(x)) << ADC_GC3_GAIN19_SHIFT)) & ADC_GC3_GAIN19_MASK)
/*! @} */

/*! @name SCTRL2 - ADC Scan Control Register 2 */
/*! @{ */

#define ADC_SCTRL2_SC_MASK                       (0xFU)
#define ADC_SCTRL2_SC_SHIFT                      (0U)
/*! SC - Scan Control Bits
 *  0b0000..Bit value 0: performs sample immediately after the completion of the current sample.
 *  0b0001..Bit value 1: delays sample until a new sync input occurs.
 */
#define ADC_SCTRL2_SC(x)                         (((uint16_t)(((uint16_t)(x)) << ADC_SCTRL2_SC_SHIFT)) & ADC_SCTRL2_SC_MASK)
/*! @} */

/*! @name SCHLTEN2 - ADC Scan Interrupt Enable Register 2 */
/*! @{ */

#define ADC_SCHLTEN2_SCHLTEN_MASK                (0xFU)
#define ADC_SCHLTEN2_SCHLTEN_SHIFT               (0U)
/*! SCHLTEN - SCHLTEN
 *  0b0000..Bit value 0: scan interrupt is not enabled for this sample.
 *  0b0001..Bit value 1: scan interrupt is enabled for this sample.
 */
#define ADC_SCHLTEN2_SCHLTEN(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_SCHLTEN2_SCHLTEN_SHIFT)) & ADC_SCHLTEN2_SCHLTEN_MASK)
/*! @} */

/*! @name EXPSTAT - Expansion MUX Status Register */
/*! @{ */

#define ADC_EXPSTAT_MUXAIRQ_MASK                 (0x1U)
#define ADC_EXPSTAT_MUXAIRQ_SHIFT                (0U)
/*! MUXAIRQ - ANA4 Expansion MUX Channel Scan Complete Interrupt Request
 *  0b0..A scan cycle is not completed, and no IRQ is pending.
 *  0b1..A scan cycle is completed, and an IRQ is pending.
 */
#define ADC_EXPSTAT_MUXAIRQ(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_EXPSTAT_MUXAIRQ_SHIFT)) & ADC_EXPSTAT_MUXAIRQ_MASK)

