zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_ADC.h
/*! @name EXPAUX4B - ANB4 Expansion Auxiliary Control Register */
/*! @{ */

#define ADC_EXPAUX4B_AUXSEL0_MASK                (0x3U)
#define ADC_EXPAUX4B_AUXSEL0_SHIFT               (0U)
/*! AUXSEL0 - Auxiliary Select 0 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL0(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL0_SHIFT)) & ADC_EXPAUX4B_AUXSEL0_MASK)

#define ADC_EXPAUX4B_AUXSEL1_MASK                (0xCU)
#define ADC_EXPAUX4B_AUXSEL1_SHIFT               (2U)
/*! AUXSEL1 - Auxiliary Select 1 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL1(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL1_SHIFT)) & ADC_EXPAUX4B_AUXSEL1_MASK)

#define ADC_EXPAUX4B_AUXSEL2_MASK                (0x30U)
#define ADC_EXPAUX4B_AUXSEL2_SHIFT               (4U)
/*! AUXSEL2 - Auxiliary Select 2 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL2(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL2_SHIFT)) & ADC_EXPAUX4B_AUXSEL2_MASK)

#define ADC_EXPAUX4B_AUXSEL3_MASK                (0xC0U)
#define ADC_EXPAUX4B_AUXSEL3_SHIFT               (6U)
/*! AUXSEL3 - Auxiliary Select 3 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL3(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL3_SHIFT)) & ADC_EXPAUX4B_AUXSEL3_MASK)

#define ADC_EXPAUX4B_AUXSEL4_MASK                (0x300U)
#define ADC_EXPAUX4B_AUXSEL4_SHIFT               (8U)
/*! AUXSEL4 - Auxiliary Select 4 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL4(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL4_SHIFT)) & ADC_EXPAUX4B_AUXSEL4_MASK)

#define ADC_EXPAUX4B_AUXSEL5_MASK                (0xC00U)
#define ADC_EXPAUX4B_AUXSEL5_SHIFT               (10U)
/*! AUXSEL5 - Auxiliary Select 5 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL5(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL5_SHIFT)) & ADC_EXPAUX4B_AUXSEL5_MASK)

#define ADC_EXPAUX4B_AUXSEL6_MASK                (0x3000U)
#define ADC_EXPAUX4B_AUXSEL6_SHIFT               (12U)
/*! AUXSEL6 - Auxiliary Select 6 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL6(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL6_SHIFT)) & ADC_EXPAUX4B_AUXSEL6_MASK)

#define ADC_EXPAUX4B_AUXSEL7_MASK                (0xC000U)
#define ADC_EXPAUX4B_AUXSEL7_SHIFT               (14U)
/*! AUXSEL7 - Auxiliary Select 7 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL7(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL7_SHIFT)) & ADC_EXPAUX4B_AUXSEL7_MASK)
/*! @} */

/*! @name EXPMUX4A0 - ANA4 Expansion MUX Control Register 0 */
/*! @{ */

#define ADC_EXPMUX4A0_MUXSEL0_MASK               (0x7U)
#define ADC_EXPMUX4A0_MUXSEL0_SHIFT              (0U)
/*! MUXSEL0 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A0_MUXSEL0(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MUXSEL0_SHIFT)) & ADC_EXPMUX4A0_MUXSEL0_MASK)

#define ADC_EXPMUX4A0_MSDIS0_MASK                (0x8U)
#define ADC_EXPMUX4A0_MSDIS0_SHIFT               (3U)
/*! MSDIS0 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL0 and AUXSEL0 are served, and the scan sequence resets to EXPMUX4A0[MUXSEL0] and EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS0(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS0_SHIFT)) & ADC_EXPMUX4A0_MSDIS0_MASK)

#define ADC_EXPMUX4A0_MUXSEL1_MASK               (0x70U)
#define ADC_EXPMUX4A0_MUXSEL1_SHIFT              (4U)
/*! MUXSEL1 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A0_MUXSEL1(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MUXSEL1_SHIFT)) & ADC_EXPMUX4A0_MUXSEL1_MASK)

#define ADC_EXPMUX4A0_MSDIS1_MASK                (0x80U)
#define ADC_EXPMUX4A0_MSDIS1_SHIFT               (7U)
/*! MSDIS1 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL1 and AUXSEL1 are served, and the scan sequence resets to EXPMUX4A0[MUXSEL0] and EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS1(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS1_SHIFT)) & ADC_EXPMUX4A0_MSDIS1_MASK)

#define ADC_EXPMUX4A0_MUXSEL2_MASK               (0x700U)
#define ADC_EXPMUX4A0_MUXSEL2_SHIFT              (8U)
/*! MUXSEL2 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A0_MUXSEL2(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MUXSEL2_SHIFT)) & ADC_EXPMUX4A0_MUXSEL2_MASK)

