zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_ADC.h
#define ADC_EXPMUX4A0_MSDIS2_MASK                (0x800U)
#define ADC_EXPMUX4A0_MSDIS2_SHIFT               (11U)
/*! MSDIS2 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL2 and AUXSEL2 are served, and the scan sequence resets to EXPMUX4A0[MUXSEL0] and EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS2(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS2_SHIFT)) & ADC_EXPMUX4A0_MSDIS2_MASK)

#define ADC_EXPMUX4A0_MUXSEL3_MASK               (0x7000U)
#define ADC_EXPMUX4A0_MUXSEL3_SHIFT              (12U)
/*! MUXSEL3 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A0_MUXSEL3(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MUXSEL3_SHIFT)) & ADC_EXPMUX4A0_MUXSEL3_MASK)

#define ADC_EXPMUX4A0_MSDIS3_MASK                (0x8000U)
#define ADC_EXPMUX4A0_MSDIS3_SHIFT               (15U)
/*! MSDIS3 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL3 and AUXSEL3 are served, and the scan sequence resets to EXPMUX4A0[MUXSEL0] and EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS3(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS3_SHIFT)) & ADC_EXPMUX4A0_MSDIS3_MASK)
/*! @} */

/*! @name EXPMUX4A1 - ANA4 Expansion MUX Control Register 1 */
/*! @{ */

#define ADC_EXPMUX4A1_MUXSEL4_MASK               (0x7U)
#define ADC_EXPMUX4A1_MUXSEL4_SHIFT              (0U)
/*! MUXSEL4 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A1_MUXSEL4(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MUXSEL4_SHIFT)) & ADC_EXPMUX4A1_MUXSEL4_MASK)

#define ADC_EXPMUX4A1_MSDIS4_MASK                (0x8U)
#define ADC_EXPMUX4A1_MSDIS4_SHIFT               (3U)
/*! MSDIS4 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL4 and AUXSEL4 are served, and the scan sequence resets to EXPMUX4A0[MUXSEL0] and EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A1_MSDIS4(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS4_SHIFT)) & ADC_EXPMUX4A1_MSDIS4_MASK)

#define ADC_EXPMUX4A1_MUXSEL5_MASK               (0x70U)
#define ADC_EXPMUX4A1_MUXSEL5_SHIFT              (4U)
/*! MUXSEL5 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A1_MUXSEL5(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MUXSEL5_SHIFT)) & ADC_EXPMUX4A1_MUXSEL5_MASK)

#define ADC_EXPMUX4A1_MSDIS5_MASK                (0x80U)
#define ADC_EXPMUX4A1_MSDIS5_SHIFT               (7U)
/*! MSDIS5 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL5 and AUXSEL5 are served, and the scan sequence resets to EXPMUX4A0[MUXSEL0] and EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A1_MSDIS5(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS5_SHIFT)) & ADC_EXPMUX4A1_MSDIS5_MASK)

#define ADC_EXPMUX4A1_MUXSEL6_MASK               (0x700U)
#define ADC_EXPMUX4A1_MUXSEL6_SHIFT              (8U)
/*! MUXSEL6 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A1_MUXSEL6(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MUXSEL6_SHIFT)) & ADC_EXPMUX4A1_MUXSEL6_MASK)

#define ADC_EXPMUX4A1_MSDIS6_MASK                (0x800U)
#define ADC_EXPMUX4A1_MSDIS6_SHIFT               (11U)
/*! MSDIS6 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL6 and AUXSEL6 are served, and the scan sequence resets to EXPMUX4A0[MUXSEL0] and EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A1_MSDIS6(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS6_SHIFT)) & ADC_EXPMUX4A1_MSDIS6_MASK)

#define ADC_EXPMUX4A1_MUXSEL7_MASK               (0x7000U)
#define ADC_EXPMUX4A1_MUXSEL7_SHIFT              (12U)
/*! MUXSEL7 - Select MUX channel to ANA4
 *  0b000..MUX's channel 0 (ANA40 analog input pin).
 *  0b001..MUX's channel 1 (ANA4a analog input pin).
 *  0b010..MUX's channel 2 (ANA4b analog input pin).
 *  0b011..MUX's channel 3 (ANA4c analog input pin).
 *  0b100..MUX's channel 4 (ANA4d analog input pin).
 *  0b101..MUX's channel 5 (ANA4e analog input pin).
 *  0b110..MUX's channel 6 (ANA4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4A1_MUXSEL7(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MUXSEL7_SHIFT)) & ADC_EXPMUX4A1_MUXSEL7_MASK)

#define ADC_EXPMUX4A1_MSDIS7_MASK                (0x8000U)
#define ADC_EXPMUX4A1_MSDIS7_SHIFT               (15U)
/*! MSDIS7 - MUX Select Disable */
#define ADC_EXPMUX4A1_MSDIS7(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS7_SHIFT)) & ADC_EXPMUX4A1_MSDIS7_MASK)
/*! @} */

