zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_ADC.h
/*! @name EXPMUX4B0 - ANB4 Expansion MUX Control Register 0 */
/*! @{ */

#define ADC_EXPMUX4B0_MUXSEL0_MASK               (0x7U)
#define ADC_EXPMUX4B0_MUXSEL0_SHIFT              (0U)
/*! MUXSEL0 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B0_MUXSEL0(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MUXSEL0_SHIFT)) & ADC_EXPMUX4B0_MUXSEL0_MASK)

#define ADC_EXPMUX4B0_MSDIS0_MASK                (0x8U)
#define ADC_EXPMUX4B0_MSDIS0_SHIFT               (3U)
/*! MSDIS0 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL0 and AUXSEL0 are served, and the scan sequence resets to EXPMUX4B0[MUXSEL0] and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS0(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS0_SHIFT)) & ADC_EXPMUX4B0_MSDIS0_MASK)

#define ADC_EXPMUX4B0_MUXSEL1_MASK               (0x70U)
#define ADC_EXPMUX4B0_MUXSEL1_SHIFT              (4U)
/*! MUXSEL1 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B0_MUXSEL1(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MUXSEL1_SHIFT)) & ADC_EXPMUX4B0_MUXSEL1_MASK)

#define ADC_EXPMUX4B0_MSDIS1_MASK                (0x80U)
#define ADC_EXPMUX4B0_MSDIS1_SHIFT               (7U)
/*! MSDIS1 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL1 and AUXSEL1 are served, and the scan sequence resets to EXPMUX4B0[MUXSEL0] and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS1(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS1_SHIFT)) & ADC_EXPMUX4B0_MSDIS1_MASK)

#define ADC_EXPMUX4B0_MUXSEL2_MASK               (0x700U)
#define ADC_EXPMUX4B0_MUXSEL2_SHIFT              (8U)
/*! MUXSEL2 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B0_MUXSEL2(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MUXSEL2_SHIFT)) & ADC_EXPMUX4B0_MUXSEL2_MASK)

#define ADC_EXPMUX4B0_MSDIS2_MASK                (0x800U)
#define ADC_EXPMUX4B0_MSDIS2_SHIFT               (11U)
/*! MSDIS2 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL2 and AUXSEL2 are served, and the scan sequence resets to EXPMUX4B0[MUXSEL0] and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS2(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS2_SHIFT)) & ADC_EXPMUX4B0_MSDIS2_MASK)

#define ADC_EXPMUX4B0_MUXSEL3_MASK               (0x7000U)
#define ADC_EXPMUX4B0_MUXSEL3_SHIFT              (12U)
/*! MUXSEL3 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B0_MUXSEL3(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MUXSEL3_SHIFT)) & ADC_EXPMUX4B0_MUXSEL3_MASK)

#define ADC_EXPMUX4B0_MSDIS3_MASK                (0x8000U)
#define ADC_EXPMUX4B0_MSDIS3_SHIFT               (15U)
/*! MSDIS3 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL3 and AUXSEL3 are served, and the scan sequence resets to EXPMUX4B0[MUXSEL0] and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS3(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS3_SHIFT)) & ADC_EXPMUX4B0_MSDIS3_MASK)
/*! @} */

/*! @name EXPMUX4B1 - ANB4 Expansion MUX Control Register 1 */
/*! @{ */

#define ADC_EXPMUX4B1_MUXSEL4_MASK               (0x7U)
#define ADC_EXPMUX4B1_MUXSEL4_SHIFT              (0U)
/*! MUXSEL4 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B1_MUXSEL4(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MUXSEL4_SHIFT)) & ADC_EXPMUX4B1_MUXSEL4_MASK)

#define ADC_EXPMUX4B1_MSDIS4_MASK                (0x8U)
#define ADC_EXPMUX4B1_MSDIS4_SHIFT               (3U)
/*! MSDIS4 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL4 and AUXSEL4 are served, and the scan sequence resets to EXPMUX4B0[MUXSEL0] and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B1_MSDIS4(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS4_SHIFT)) & ADC_EXPMUX4B1_MSDIS4_MASK)

#define ADC_EXPMUX4B1_MUXSEL5_MASK               (0x70U)
#define ADC_EXPMUX4B1_MUXSEL5_SHIFT              (4U)
/*! MUXSEL5 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B1_MUXSEL5(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MUXSEL5_SHIFT)) & ADC_EXPMUX4B1_MUXSEL5_MASK)

#define ADC_EXPMUX4B1_MSDIS5_MASK                (0x80U)
#define ADC_EXPMUX4B1_MSDIS5_SHIFT               (7U)
/*! MSDIS5 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL5 and AUXSEL5 are served, and the scan sequence resets to EXPMUX4B0[MUXSEL0] and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B1_MSDIS5(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS5_SHIFT)) & ADC_EXPMUX4B1_MSDIS5_MASK)

#define ADC_EXPMUX4B1_MUXSEL6_MASK               (0x700U)
#define ADC_EXPMUX4B1_MUXSEL6_SHIFT              (8U)
/*! MUXSEL6 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B1_MUXSEL6(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MUXSEL6_SHIFT)) & ADC_EXPMUX4B1_MUXSEL6_MASK)

