zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_ADC.h
#define ADC_EXPMUX4B1_MSDIS6_MASK                (0x800U)
#define ADC_EXPMUX4B1_MSDIS6_SHIFT               (11U)
/*! MSDIS6 - MUX Select Disable
 *  0b0..Expansion MUX scan continues.
 *  0b1..Expansion MUX scan stops after MUXSEL6 and AUXSEL6 are served, and the scan sequence resets to EXPMUX4B0[MUXSEL0] and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B1_MSDIS6(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS6_SHIFT)) & ADC_EXPMUX4B1_MSDIS6_MASK)

#define ADC_EXPMUX4B1_MUXSEL7_MASK               (0x7000U)
#define ADC_EXPMUX4B1_MUXSEL7_SHIFT              (12U)
/*! MUXSEL7 - Select MUX channel to ANB4
 *  0b000..MUX's channel 0 (ANB40 analog input pin).
 *  0b001..MUX's channel 1 (ANB4a analog input pin).
 *  0b010..MUX's channel 2 (ANB4b analog input pin).
 *  0b011..MUX's channel 3 (ANB4c analog input pin).
 *  0b100..MUX's channel 4 (ANB4d analog input pin).
 *  0b101..MUX's channel 5 (ANB4e analog input pin).
 *  0b110..MUX's channel 6 (ANB4f analog input pin).
 *  0b111..MUX's channel 7 (internal 1.2 V reference).
 */
#define ADC_EXPMUX4B1_MUXSEL7(x)                 (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MUXSEL7_SHIFT)) & ADC_EXPMUX4B1_MUXSEL7_MASK)

#define ADC_EXPMUX4B1_MSDIS7_MASK                (0x8000U)
#define ADC_EXPMUX4B1_MSDIS7_SHIFT               (15U)
/*! MSDIS7 - MUX Select Disable */
#define ADC_EXPMUX4B1_MSDIS7(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS7_SHIFT)) & ADC_EXPMUX4B1_MSDIS7_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ADC_Register_Masks */

/* Backward compatibility */
#define ADC_CAL_SEL_VREFLO_A_MASK                ADC_CAL_SEL_VREFL_A_MASK
#define ADC_CAL_SEL_VREFLO_A_SHIFT               ADC_CAL_SEL_VREFL_A_SHIFT
#define ADC_CAL_SEL_VREFLO_A(x)                  ADC_CAL_SEL_VREFL_A(x)
#define ADC_CAL_SEL_VREFLO_B_MASK                ADC_CAL_SEL_VREFL_B_MASK
#define ADC_CAL_SEL_VREFLO_B_SHIFT               ADC_CAL_SEL_VREFL_B_SHIFT
#define ADC_CAL_SEL_VREFLO_B(x)                  ADC_CAL_SEL_VREFL_B(x)


/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ADC_H_ */

